import numpy as np
arr2 = np.array([[1, 2, 3], [4, 5, 6]])
arr3 = np.array([[[1, 2, 3], [4, 5, 6], [7, 8, 9]]])
print('二维数组为：\n', arr2,'\n三维数组为：\n',arr3)


print("\n","-*-"*10," 索引 ","-*-"*10)


# 索引 -- 二维
print("===> 2维")
# 只有一个索引指标时，会在第0维上索引，后面的维度保持不变
print('arr2[0]为：', arr2[0])
# 两个索引指标
print('arr2[0][0]为：', arr2[0][0])
print('arr2[0,1]为：', arr2[0,1])
rows = arr2[0,2] # 0行2列
print('arr2[0,2]为：',rows)

# 索引 -- 三维
print("===> 3维")
print('arr3[0]为：\n', arr3[0])   # 得到一个二维数组
print('arr3[0][0]为：', arr3[0][0])   # 得到一个一维数组
print('arr3[0,1]为：', arr3[0,1]) # 得到一个一维数组
print('arr3[0,0,1]为：', arr3[0,0,1]) # 得到一个标量




print("\n","-*-"*10," 切片 ","-*-"*10)
# 如果不切列，列可以省略，如果不切行，需要使用: 代替

# 切片 -- 二维
print("===> 2维")
# 选择特定的一行
print('arr2[1:2]为：', arr2[0:1])
# 选择特定的一列
print('arr2[:,0]为：', arr2[:,0])
# 选择连续的多行
print('arr2[0:2]为：\n', arr2[0:2])
# 选择连续的多列
# 选择不连续的多行
# 选择不连续的多列
# 同时选择行和列




# 切片 -- 三维
# 选择特定的一行
# 选择特定的一列
# 选择连续的多行
# 选择连续的多列
# 选择不连续的多行
# 选择不连续的多列
# 同时选择行和列